app/views/books/show.html.erb

SELECT "publications".* FROM "publications" WHERE "publications"."book_id" = ?  [["book_id", 980190962]]
---
  <p>
  <% if @book.publications.empty? %>