app/controllers/authors_controller.rb

  def show
    @author = Author.find(params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]